# GetId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementRecord..::..GetId Method
ElementRecord Class See Also
---
Gets the id of the element record.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId GetId()
```

Visual Basic
---
```text
Public Function GetId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetId()
```

# ### Return Value
The element id.
# See Also
ElementRecord Class
Autodesk.Revit.DB Namespace